servicesbd/test1/serviceAvailRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.juniper.es/webservice/2007/">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:ServiceAvail>
         <ns:ServiceAvailRQ Version="1.1" Language="es">
            <ns:Login Password="Dkf94j512#" Email="waleed.medhat@wingsholding.com"/>
            <ns:Paxes>
               <ns:Pax IdPax="1">
                  <ns:Age>30</ns:Age>
               </ns:Pax>
               <ns:Pax IdPax="2">
                  <ns:Age>32</ns:Age>
               </ns:Pax>
            </ns:Paxes>
            <ns:ServiceRequest>
               <ns:SearchSegmentsServices>
                  <ns:SearchSegmenServices Start="2020-04-03" End="2020-04-07" DestinationZone = "15011"></ns:SearchSegmenServices>
               </ns:SearchSegmentsServices>  
                <ns:RelPaxesDist>
                  <ns:RelPaxDist>
                     <ns:RelPaxes>
                        <ns:RelPax IdPax="1"></ns:RelPax>
                        <ns:RelPax IdPax="2"></ns:RelPax>
                     </ns:RelPaxes>
                  </ns:RelPaxDist>
               </ns:RelPaxesDist>             
            </ns:ServiceRequest>
         </ns:ServiceAvailRQ>
      </ns:ServiceAvail>
   </soapenv:Body>
</soapenv:Envelope>